{
    "Experiences": [
        {
            "id": 1,
            "company_title": "Corporateserve Solutions",
            "location": "Onsite, Gurgaon, Haryana",
            "designation": "Frontend Developer (UI).",
            "duration": "From April 2024 To Present",
            "summary": "Conducted pre-project analysis and technical assessments focusing on UX/UI design and requirements for Back Office Management. Utilized Agile methodologies to manage tasks across various systems, including campus and hospital management. Led strategic planning, addressed complex technical challenges, and facilitated cross-functional collaboration to optimize and implement software solutions."
        },
        {
            "id": 2,
            "company_title": "Quara Digital",
            "location": "Remote, Riyadh, UAE",
            "designation": "Frontend Developer (UI).",
            "duration": "From June 2023 To April 2024",
            "summary": "Conducted pre-project analysis and technical assessments for real estate platforms wasalt.com and darglobal.co.uk, focusing on UX/UI design and technical requirements. Utilized Agile methodologies for efficient task management across multiple projects, led strategic planning to align with business goals, and collaborated with senior developers to address complex challenges and implement advanced features. Conducted market research to guide decision-making and fostered cross-functional collaboration to ensure effective implementation of tailored real estate solutions."
        },
        {
            "id": 3,
            "company_title": "CEDCOSS Technologies",
            "location": "Onsite, Lucknow, UP",
            "designation": "Frontend Developer (UI).",
            "duration": "From Sept. 2021 To June 2023",
            "summary": "Conducted pre-project analysis and technical assessments for user-friendly Shopify interfaces, managing tasks for over 30 concurrent projects. Led strategic planning for Shopify and web development, executed special projects, and researched market trends for optimal solutions. Collaborated with technical and design teams to develop innovative Shopify applications and designed systems based on initial briefs."
        },
        {
            "id":4,
            "company_title": "SDK ITS SOLUTIONS",
            "location": "Onsite, Gurgaon, Haryana",
            "designation": "Software Engineer",
            "duration": "From Dec. 2019 To Aug. 2021",
            "summary": "Collaborated with designers and product managers to create innovative products. Developed efficient, well-tested code for diverse software projects and devised test cases to evaluate enhancements and functionality expansions."
        }
    ]
}